RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32H7xx_Firmware_Library/GD32H7xx_standard_peripheral/Source/gd32h7xx_ipa.c
    if(SET == tempflag){
        /* restore the state of TEN */
        IPA_CTL |= IPA_CTL_TEN;
    }
}

/*!
    \brief      initialize IPA foreground LUT parameters
    \param[in]  fg_lut_num: foreground LUT number of pixel
    \param[in]  fg_lut_pf: foreground LUT pixel format(IPA_LUT_PF_ARGB8888, IPA_LUT_PF_RGB888)
    \param[in]  fg_lut_addr: foreground LUT memory base address
    \param[out] none
    \retval     none
*/
void ipa_foreground_lut_init(uint8_t fg_lut_num, uint8_t fg_lut_pf, uint32_t fg_lut_addr)
{
    FlagStatus tempflag = RESET;
    if(RESET != (IPA_FPCTL & IPA_FPCTL_FLLEN)){
        tempflag = SET;
        /* reset the FLLEN in order to configure the following bits */
        IPA_FPCTL &= ~IPA_FPCTL_FLLEN;
    }
    
    /* foreground LUT number of pixel configuration */
    IPA_FPCTL |= ((uint32_t)fg_lut_num << 8U);
    /* foreground LUT pixel format configuration */
    if(IPA_LUT_PF_RGB888 == fg_lut_pf){
        IPA_FPCTL |= IPA_FPCTL_FLPF;
    }else if(IPA_LUT_PF_ARGB8888 == fg_lut_pf){
        IPA_FPCTL &= ~(IPA_FPCTL_FLPF);
    }else{
    }
    /* foreground LUT memory base address configuration */
    IPA_FLMADDR &= ~(IPA_FLMADDR_FLMADDR);
    IPA_FLMADDR = fg_lut_addr;
    
    if(SET == tempflag){
        /* restore the state of FLLEN */
        IPA_FPCTL |= IPA_FPCTL_FLLEN;
    }
}

/*!
    \brief      initialize IPA background LUT parameters
    \param[in]  bg_lut_num: background LUT number of pixel
    \param[in]  bg_lut_pf: background LUT pixel format(IPA_LUT_PF_ARGB8888, IPA_LUT_PF_RGB888)
    \param[in]  bg_lut_addr: background LUT memory base address
    \param[out] none
    \retval     none
*/
void ipa_background_lut_init(uint8_t bg_lut_num, uint8_t bg_lut_pf, uint32_t bg_lut_addr)
{
    FlagStatus tempflag = RESET;
    if(RESET != (IPA_BPCTL & IPA_BPCTL_BLLEN)){
        tempflag = SET;
        /* reset the BLLEN in order to configure the following bits */
        IPA_BPCTL &= ~IPA_BPCTL_BLLEN;
    }
    
    /* background LUT number of pixel configuration */
    IPA_BPCTL |= ((uint32_t)bg_lut_num << 8U);
    /* background LUT pixel format configuration */
    if(IPA_LUT_PF_RGB888 == bg_lut_pf){
        IPA_BPCTL |= IPA_BPCTL_BLPF;
    }else if(IPA_LUT_PF_ARGB8888 == bg_lut_pf){
        IPA_BPCTL &= ~(IPA_BPCTL_BLPF);
    }else{
    }
    /* background LUT memory base address configuration */
    IPA_BLMADDR &= ~(IPA_BLMADDR_BLMADDR);
    IPA_BLMADDR = bg_lut_addr;
    
    if(SET == tempflag){
        /* restore the state of BLLEN */
        IPA_BPCTL |= IPA_BPCTL_BLLEN;
    }
}

/*!
    \brief      configure IPA line mark
    \param[in]  line_num: line number
    \param[out] none
    \retval     none
*/
void ipa_line_mark_config(uint16_t line_num)
{
    IPA_LM &= ~(IPA_LM_LM);
    IPA_LM = line_num;
}

/*!
    \brief      inter-timer enable or disable
    \param[in]  timer_cfg: IPA_INTER_TIMER_ENABLE,IPA_INTER_TIMER_DISABLE
    \param[out] none
    \retval     none
*/
void ipa_inter_timer_config(uint8_t timer_cfg)
{
    if(IPA_INTER_TIMER_ENABLE == timer_cfg){
        /* inter-timer enable */
        IPA_ITCTL |= IPA_ITCTL_ITEN;
    }else if(IPA_INTER_TIMER_DISABLE == timer_cfg){
        /* inter-timer disable */
        IPA_ITCTL &= ~(IPA_ITCTL_ITEN);
    }else{
        /* do nothing */
    }
}

/*!
    \brief      configure the number of clock cycles interval
    \param[in]  clk_num: the number of clock cycles
    \param[out] none
    \retval     none
*/
void ipa_interval_clock_num_config(uint8_t clk_num)
{
    /* NCCI[7:0] bits have no meaning if ITEN is '0' */
    IPA_ITCTL &= ~(IPA_ITCTL_NCCI);
    IPA_ITCTL |= ((uint32_t)clk_num << 8U);
}

/*!
    \brief      configure the color space conversion parameter
    \param[out] conversion_struct: the data needed to configure color conversion parameters
    \param[in]  ipa_colorspace_enum: the color space
                  IPA_COLORSPACE_YUV: using default YUV parameter to initialization struct
                  IPA_COLORSPACE_YCBCR: using default YCbCr parameter to initialization struct
    \retval     none
*/
void ipa_color_conversion_struct_para_init(ipa_conversion_parameter_struct* conversion_struct, ipa_colorspace_enum colorspace)
{    
    if(IPA_COLORSPACE_YUV == colorspace){
        /* initialize the struct parameters with default YUV conversion values */
        conversion_struct->color_space = IPA_COLORSPACE_YUV;
        conversion_struct->y_offset = IPA_DEFAULT_YUV_CONV_YOFFSET;
        conversion_struct->uv_offset = IPA_DEFAULT_YUV_CONV_UVOFFSET;
        conversion_struct->coef_c0 = IPA_DEFAULT_YUV_CONV_C0OFFSET;
        conversion_struct->coef_c1 = IPA_DEFAULT_YUV_CONV_C1OFFSET;
        conversion_struct->coef_c2 = IPA_DEFAULT_YUV_CONV_C2OFFSET;
        conversion_struct->coef_c3 = IPA_DEFAULT_YUV_CONV_C3OFFSET;
        conversion_struct->coef_c4 = IPA_DEFAULT_YUV_CONV_C4OFFSET;
    }else if(IPA_COLORSPACE_YCBCR == colorspace){
        /* initialize the struct parameters with default YCbCr conversion values */
        conversion_struct->color_space = IPA_COLORSPACE_YCBCR;
        conversion_struct->y_offset = IPA_DEFAULT_YCBCR_CONV_YOFFSET;
        conversion_struct->uv_offset = IPA_DEFAULT_YCBCR_CONV_UVOFFSET;
        conversion_struct->coef_c0 = IPA_DEFAULT_YCBCR_CONV_C0OFFSET;
        conversion_struct->coef_c1 = IPA_DEFAULT_YCBCR_CONV_C1OFFSET;
        conversion_struct->coef_c2 = IPA_DEFAULT_YCBCR_CONV_C2OFFSET;
        conversion_struct->coef_c3 = IPA_DEFAULT_YCBCR_CONV_C3OFFSET;
        conversion_struct->coef_c4 = IPA_DEFAULT_YCBCR_CONV_C4OFFSET;
    }else{
        /* do nothing */
    }
}

/*!
    \brief      configure the color space conversion parameter
    \param[in]  conversion_struct: the data needed to configure color conversion parameters
                  color_space: IPA_COLORSPACE_YUV, IPA_COLORSPACE_YCBCR
                  y_offset: offset implicit in the Y data
                  uv_offset: offset implicit in the UV data
                  coef_c0: Y multiplier coefficient
                  coef_c1: V/Cr red multiplier coefficient
                  coef_c2: V/Cr green multiplier coefficient
                  coef_c3: U/Cb green multiplier coefficient 
                  coef_c4: U/Cb blue multiplier coefficient
    \param[out] none
    \retval     none
*/
void ipa_color_conversion_config(ipa_conversion_parameter_struct* conversion_struct)
{
    FlagStatus tempflag = RESET;
    if(RESET != (IPA_CTL & IPA_CTL_TEN)){
        tempflag = SET;
        /* reset the TEN in order to configure the following bits */
        IPA_CTL &= ~IPA_CTL_TEN;
    }
    
    /* Y offset, UV offset, compliment Y multiplier configuration */
    IPA_CSCC_CFG0 &= ~(IPA_CSCC_CFG0_YOFF | IPA_CSCC_CFG0_UVOFF | IPA_CSCC_CFG0_C0);
    IPA_CSCC_CFG0 |= (((conversion_struct->y_offset) & IPA_CSCC_CFG0_YOFF) | 
                      ((uint32_t)(conversion_struct->uv_offset << 9U) & IPA_CSCC_CFG0_UVOFF) | 
                      ((uint32_t)(conversion_struct->coef_c0 << 18U) & IPA_CSCC_CFG0_C0));
    /* red V/Cr multiplier, blue U/Cb multiplier configuration */
    IPA_CSCC_CFG1 &= ~(IPA_CSCC_CFG1_C1 | IPA_CSCC_CFG1_C4);
    IPA_CSCC_CFG1 |= ((conversion_struct->coef_c4 & IPA_CSCC_CFG1_C4) |
                     ((uint32_t)(conversion_struct->coef_c1 << 16U) & IPA_CSCC_CFG1_C1));
    /* green V/Cr multiplier coefficient, green U/Cb multiplier configuration */
    IPA_CSCC_CFG2 &= ~(IPA_CSCC_CFG2_C2 | IPA_CSCC_CFG2_C3);
    IPA_CSCC_CFG2 |= ((conversion_struct->coef_c3 & IPA_CSCC_CFG2_C3) |
                     ((uint32_t)(conversion_struct->coef_c2 << 16U) & IPA_CSCC_CFG2_C2));
    
    if(IPA_COLORSPACE_YUV == conversion_struct->color_space){
        /* convert YUV to RGB */
        IPA_CSCC_CFG0 &= ~(IPA_CSCC_CFG0_CONVMOD);
    }else{
        /* convert YCbCr to RGB */
        IPA_CSCC_CFG0 |= IPA_CSCC_CFG0_CONVMOD;
    }
    
